# если на районе идёт дождь
# поем
# посмотрю телевизор
# приготовлю ужин
# пойду в магазин
# лягу спать

# шаблон условного оператора
# if условие:
#     тело
#     условного
#     оператора
# elif условие:
#     тело
#     условного
#     оператора
# ...
# else:
#     тело
#     оператора
#     иначе



# Трискайдекафобия
number = int(input("Введите число: "))
if number == 13:
    print("О нет! Это страшное число!")
else:
    print(f"Вы ввели число {number}!")

input("Нажмите Enter, чтобы выйти...")